class CommandDescription:
    user_commands = {
        'start': '▶️ Запуск бота'
    }

class CommonMessages:
    WELCOME_MESSAGE = "👨‍💻 Этот бот принадлежит Центру Разработки Цифровых Сервисов"
    CANCEL = "❌ Отмена"
    CANCEL_ACTION = "❌ Действие отменено"
    ECHO_ALL = "Чтобы бот отправлял сообщения в ваш чат, сначала авторизуйтесь"

class AuthMessages:
    NOT_ADMIN = "❌ Вы не администратор!"

class ButtonMessages:
    LOGIN_INSTITUTION = "🔐Авторизоваться"

class InstitutionMessages:
    CODE_MESSAGE = "🔢Введите код вашей организации из платформы."
    INSTITUTION_NOT_FOUND = "❌ Неверный код"